# coding:utf-8


ANSWER_LINK = \
    """您需要根据办理说明完成以下材料，完成后即可到工商局办理相应业务。
        所需材料请到通州工商局网站自行下载打印。\n<a href="{}/individual?id={}">
        点击查看办理材料</a>
    """

WELCOME_MESSAGE = \
    u"""您好，欢迎关注北京市工商局通州分局微信服务号， 我们为您提供企业登记、个性化告知、企业信用查询、登记机关地图导航等服务
    您可以直接点击进行操作， 通州工商将竭诚为您服务。
"""

INDIVIDUAL_RESPONSE = \
    u"""申请人您好：您已进入工商企业登记个性化告知服务，我们的系统会根据您的选择，提供适合您的办理材料清单及各种文书的参考格式。
    您只需回复相应数字即可。（温馨提示：请您仔细阅读后再做出选择，以免由于选择错误给您带来的不便）
    【1】办理公司设立
    【2】办理公司变更（备案）
    【3】办理公司注销
    【4】办理其他业务
"""

NO_THIS_SELECTION = u"对不起, 你输入的选项有误. 重新选择请输入0"

FIND_NO_RP = u"您好，我们的微信服务号暂不提供人工服务，如您需要人工咨询，请您拨打69547016."

EXTRA_NOTICE = u"\n【0】返回上一层"
