#!/usr/bin/env python
# coding: utf-8
import sys
reload(sys)
sys.setdefaultencoding("utf-8")


book = {
    'name': '股东会决议书',
    'rules': ['2', '1', ['1', '3', '4', '5', '7', '8', '9', '11', '12', '13', '14']],
    'header': """_________（企业名称）\n股东会决议（参考格式）\n___年___月___日在_________（地址）召开了___________（企业名称）股东会，会议召集人 （人名），出席人、（全体股东姓名），代表股权%，参加会议的股东在人数和资格等方面符合有关规定，会议以书面方式通知股东参加会议，表决比例和议事规则符合《公司法》及公司章程的规定，会议形成决议如下：\n""",
    'bottom': """同意修改原章程。\n股东亲笔签字或盖章：\n年     月    日""",
    'link': """<a href="http://pwechat.duapp.com/individual/decision?select={}&index={}">股东会决议</a>(需自然人股东亲笔签字， 法人股东加盖公章。（股东数量应符合章程规定股东表决比例)\n\n""",
    'link_special': """<a href="http://pwechat.duapp.com/individual/decision?select={}&index={}">股东会决议(新股东)</a>办理说明: 新股东签署, 自然人股东亲笔签字，法人股东加盖公章。\n\n""",
    'content': {
        '1': """（变更名称）同意___________（企业名称）变更名称为　　　　　　　　____________（新企业名称）。""",
        '3': """（变更法定代表人）同意免去________执行董事职务；选举_____为执行董事。（此参考格式适用于执行董事为公司法定代表人情形，若经理为法定代表人，则出具执行董事决定或董事会决议解聘和聘任经理。）""",
        '4': """（变更注册资本）同意变更注册资本，由_____万元变更到_______万元。其中_____（股东姓名）以____方式增加出资_____万元，于__年__月__日前缴齐。变更后重新确认股权为：\n股东____以（出资方式）出资____万元占注册资本___％。\n股东____以（出资方式）出资____万元占注册资本___％。\n股东____以（出资方式）出资____万元占注册资本___％。""",
        '5': """（变更注册资本）同意变更注册资本，由_____万元变更到_______万元。其中_____（股东姓名）以____方式减少出资_____万元。变更后重新确认股权为：\n股东____以（出资方式）出资____万元占注册资本___％。\n股东____以（出资方式）出资____万元占注册资本___％。\n股东____以（出资方式）出资____万元占注册资本___％。""",
        '7': """（变更经营期限）同意_________________（企业名称）经营期限变更为_________年。""",
        '8': """ 由______、______组成新一届股东会，重新确认股权如下：______（股东姓名或名称）以______（出资方式）出资____万元，占注册资本______%。\n______（股东姓名或名称）以______（出资方式）出资____ 万元，占注册资本______%。""",
        '9': """ 由______、______组成新一届股东会，重新确认股权如下：______（股东姓名或名称）以______（出资方式）出资____万元，占注册资本______%。\n______（股东姓名或名称）以______（出资方式）出资____万元，占注册资本______%。""",
        '11': """（变更股东名称）同意股东______的名称变更为：_____。""",
        '12': "",
        '13': """（设监事会变更监事）同意免去 _______、_______监事职务，选举_______、_______、______为监事，组成公司新一届监事会。（监事会成员不得少于3人，且职工代表的比例不得低于三分之一）\n (设董事会变董事）同意免去______、______董事职务，选举_______、_______、______为董事，组成公司新一届董事会。（董事会成员３－１３人）""",
        '14': """1、因公司经营不善，全体股东一致同意注销公司；\n2、 全体股东一致同意成立清算小组，由_______、________       组成，组长_________。"""
    }
}

decision = {
    'name': '股东决定',
    'rules': ['2', ['2', '3'], ['1', '3', '4', '5', '7', '8', '9', '10', '11', '12']],
    'header': """_________（企业名称）\n股东决定（参考格式）\n股东             （股东姓名或名称）于     年  月  日在              （地址）作出如下决定：\n""",
    'bottom': """同意修改原章程。\n股东亲笔签字或盖章：\n年     月    日 """,
    'link': """<a href="http://pwechat.duapp.com/individual/decision?select={}&index={}">股东决定\n</a>(需自然人股东亲笔签字， 法人股东加盖公章。) \n\n""",
    'content': {
            '1': """（变更名称）同意___________（企业名称）变更名称为　　　　　　　　____________（新企业名称）。""",
            '3': """（变更法定代表人）同意免去_______执行董事职务；委派_____执行董事。（此参考格式适用于执行董事为公司法定代表人情形，若经理为法定代表人，则出具执行董事决定或董事会决议解聘和聘任经理。）""",
            '4': """（变更注册资本）同意变更注册资本，由_____万元变更到　　　_______万元。其中_____（股东姓名）以____方式增加出资_____万元，于__年__月__日前缴齐。变更后重新确认股权为：股东____以（出资方式）出资____万元占注册资本___％。""",
            '5': """（变更注册资本）同意变更注册资本，由_____万元变更到　　　_______万元。其中_____（股东姓名）以____方式减少出资_____万元。变更后重新确认股权为：股东____以（出资方式）出资____万元占注册资本___％。""",
            '7': """（变更经营期限）同意_________________（企业名称）经营期限变更为_________年。""",
            '8': """ 同意增加新股东______。\n（变更股东）同意股东____（原股东姓名或名称）在___________（企业名称）的_____万元出资转让给　　　_________（新股东姓名或名称）。""",
            '9': """（变更股东名称）同意股东______的名称变更为：_____。""",
            '10': "",
            '11': """（设监事会变更监事）同意免去 _______、_______监事职务，选举_______、_______、______为监事，组成公司新一届监事会。（监事会成员不得少于3人，且职工代表的比例不得低于三分之一）\n (设董事会变董事）同意免去______、______董事职务，选举_______、_______、______为董事，组成公司新一届董事会。（董事会成员３－１３人）""",
            '12': """因_______________（注销原因），股东决定注销公司；\n 股东决定成立清算小组，由__________组成，组长_____。"""
    }
}

old_book = {
    'name': '原股东决议书',
    'rules': ['2', '1', ['8', '9']],
    'header': book['header'],
    'bottom': book['bottom'],
    'link': """<a href="http://pwechat.duapp.com/individual/decision?select={}&index={}">股东会决议（原股东）\n</a>办理说明：原股东签署， 自然人股东亲笔签字， 法人股东加盖公章。""",
    'content': {
            '3': """（变更法定代表人）同意免去________执行董事职务；""",
            '8': """同意增加新股东______。\n（变更股东）同意股东____（原股东姓名或名称）在___________（企业名称）的_____万元出资转让给_________（新股东姓名或名称）。""",
            '9': """（变更股东）同意股东____（原股东姓名或名称）在___________（企业名称）的_____万元出资转让给_________（新股东姓名或名称）。""",
            '13':  """同意免去______、______董事职务。\n同意免去 _______、_______监事职务。"""
    }
}


# 添加新内容后记得更新此处
DECISION = [book, decision, old_book]


def decision_links_dumps(s, mulit_flag):
    """根据用户选择返回所有符合条件的内容的链接
    """
    from responser import MULTI_FLAG

    def _not_match():
        """找出不匹配的内容的索引
        """
        not_match = set()
        for i, select in enumerate(s):
            for j, d in enumerate(DECISION):
                rules = d['rules'][i]
                if all(x not in rules for x in select.split(MULTI_FLAG)):
                    not_match.add(j)
        return not_match

    def _links():
        not_match = _not_match()
        for i, d in enumerate(DECISION):
            if i not in not_match:
                if i == 0 and 2 not in not_match:  # 当旧股东决定和股东协议书同时出现
                    yield d['link_special'].format(s[-1], i)
                else:
                    yield d['link'].format(s[-1], i)

    s = s[:3] if len(s) >= 3 else ''

    return ''.join(_links())


def decision_content_dumps(select, index):
    from responser import MULTI_FLAG

    select = select.split(MULTI_FLAG)
    decision = DECISION[index]
    result = decision['header']
    i = 1
    for s in select:
        try:
            result += '{}.{}\n'.format(str(i), decision['content'][s])
            i += 1
        except KeyError:
            print('ignore unavailable select:{}'.format(s))
    result += '{}.{}\n'.format(str(i), decision['bottom'])

    return result

if __name__ == '__main__':
    # s = ['2', '1', '8,9']
    # print decision_links_dumps(s, ',')
    # print content_dumps('8,9', 1)
    pass
